In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier

In [2]:
titanic_train = pd.read_csv("train.csv")
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic_train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
titanic_train['Age'].fillna(titanic_train.groupby('Pclass')['Age'].transform('median'),inplace = True)

In [5]:
titanic_train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
titanic_train=titanic_train.drop(['Name','Ticket','Fare','Cabin'],axis=1)

In [7]:
titanic_train.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Embarked       2
dtype: int64

In [8]:
titanic_train=titanic_train[titanic_train['Embarked'].notna()]

In [9]:
titanic_train['Family']=titanic_train['SibSp']+titanic_train['Parch']

In [10]:
titanic_train

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Embarked,Family
0,1,0,3,male,22.0,1,0,S,1
1,2,1,1,female,38.0,1,0,C,1
2,3,1,3,female,26.0,0,0,S,0
3,4,1,1,female,35.0,1,0,S,1
4,5,0,3,male,35.0,0,0,S,0
...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,S,0
887,888,1,1,female,19.0,0,0,S,0
888,889,0,3,female,24.0,1,2,S,3
889,890,1,1,male,26.0,0,0,C,0
890,891,0,3,male,32.0,0,0,Q,0

In [11]:
titanic_train=titanic_train.drop(['SibSp','Parch'],axis=1)

In [12]:
titanic_train

     PassengerId  Survived  Pclass     Sex   Age Embarked  Family
0              1         0       3    male  22.0        S       1
1              2         1       1  female  38.0        C       1
2              3         1       3  female  26.0        S       0
3              4         1       1  female  35.0        S       1
4              5         0       3    male  35.0        S       0
..           ...       ...     ...     ...   ...      ...     ...
886          887         0       2    male  27.0        S       0
887          888         1       1  female  19.0        S       0
888          889         0       3  female  24.0        S       3
889          890         1       1    male  26.0        C       0
890          891         0       3    male  32.0        Q       0

[889 rows x 7 columns]

In [15]:
x = titanic_train.drop(['PassengerId','Survived'],axis =1)
x = pd.get_dummies(x)

In [16]:
x

,Pclass,Age,Family,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,3,22.0,1,0,1,0,0,1
1,1,38.0,1,1,0,1,0,0
2,3,26.0,0,1,0,0,0,1
3,1,35.0,1,1,0,0,0,1
4,3,35.0,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...
886,2,27.0,0,0,1,0,0,1
887,1,19.0,0,1,0,0,0,1
888,3,24.0,3,1,0,0,0,1
889,1,26.0,0,0,1,1,0,0
890,3,32.0,0,0,1,0,1,0

In [17]:
y = titanic_train.Survived

In [18]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.2,random_state=6)

In [19]:
rfc = RandomForestClassifier(random_state=3)
rfc.fit(x_train,y_train)
accuracy_score(y_test,rfc.predict(x_test))

0.797752808988764

In [20]:
from lightgbm import LGBMClassifier

In [22]:
import warnings
warnings.filterwarnings('ignore')
from sklearn.model_selection import StratifiedKFold
from sklearn.model_selection import cross_val_score

In [23]:
def cval(x, y,estimator,params,folds):

    skf = StratifiedKFold(n_splits=folds, shuffle=True, random_state=17)
    
    for fold, (train_idx, test_idx) in enumerate(skf.split(x, y)):
        x_train, y_train = x.iloc[train_idx], y.iloc[train_idx]
        x_test, y_test = x.iloc[test_idx], y.iloc[test_idx]

        model = estimator(**params)
        model.fit(x_train, y_train, eval_set=[(x_test, y_test)], early_stopping_rounds=100, verbose=0)
        accu = accuracy_score(y_test, model.predict(x_test))
        
        print(str(fold+1)+' Fold Accuracy: '+str(accu))
        print("-"*50)
    
    return model

In [25]:
params = {'learning_rate':0.1,'min_child_samples':14,'reg_alpha':7,'reg_lambda':7}

lgbm = cval(x,y,LGBMClassifier,params,5)

1 Fold Accuracy: 0.8370786516853933
--------------------------------------------------
2 Fold Accuracy: 0.7865168539325843
--------------------------------------------------
3 Fold Accuracy: 0.8033707865168539
--------------------------------------------------
4 Fold Accuracy: 0.8314606741573034
--------------------------------------------------
5 Fold Accuracy: 0.7966101694915254
--------------------------------------------------

In [26]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.2,random_state=6)

In [27]:
accuracy_score(y_test,lgbm.predict(x_test))

0.848314606741573

In [28]:
titanic_test = pd.read_csv('test.csv')
titanic_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [29]:
titanic_test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [30]:
titanic_test=titanic_test.drop(['Name','Ticket','Fare','Cabin'],axis=1)

In [31]:
titanic_test['Age'].fillna(titanic_test.groupby('Pclass')['Age'].transform('median'),inplace = True)

In [32]:
titanic_test['Family']=titanic_test['SibSp']+titanic_test['Parch']

In [33]:
titanic_test=titanic_test.drop(['SibSp','Parch'],axis=1)

In [34]:
titanic_test

     PassengerId  Pclass     Sex   Age Embarked  Family
0            892       3    male  34.5        Q       0
1            893       3  female  47.0        S       1
2            894       2    male  62.0        Q       0
3            895       3    male  27.0        S       0
4            896       3  female  22.0        S       2
..           ...     ...     ...   ...      ...     ...
413         1305       3    male  24.0        S       0
414         1306       1  female  39.0        C       0
415         1307       3    male  38.5        S       0
416         1308       3    male  24.0        S       0
417         1309       3    male  24.0        C       2

[418 rows x 6 columns]

In [35]:
id=titanic_test.PassengerId

In [36]:
titanic_test.drop(['PassengerId'],axis = 1,inplace= True)

In [37]:
titanic_test = pd.get_dummies(titanic_test)

In [38]:
titanic_test

,Pclass,Age,Family,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,3,34.5,0,0,1,0,1,0
1,3,47.0,1,1,0,0,0,1
2,2,62.0,0,0,1,0,1,0
3,3,27.0,0,0,1,0,0,1
4,3,22.0,2,1,0,0,0,1
...,...,...,...,...,...,...,...,...
413,3,24.0,0,0,1,0,0,1
414,1,39.0,0,1,0,1,0,0
415,3,38.5,0,0,1,0,0,1
416,3,24.0,0,0,1,0,0,1
417,3,24.0,2,0,1,1,0,0

In [39]:
pred = lgbm.predict(titanic_test)

In [40]:
submission = pd.DataFrame({'PassengerId':id,'Survived':pred})

In [41]:
submission

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [42]:
submission.to_csv('submission.csv',index=False)